// azkar_data.dart

// import 'package:change_notifier_provider_and_consumer/features/Azkaritem/models/zkermodel.dart';
import 'package:flutter/material.dart';
import 'package:theam_mood_with_block/feature/Azkaritem/models/zkermodel.dart';
// import 'zkermodel.dart'; // تأكد إنك بتستورد الموديل الخاص بالأذكار.

final List<AzkarItem> azkarList = [
  AzkarItem(
    title: "أذكار الصباح",
    icon: Icons.wb_cloudy,
    azkarTexts: [
      ZekrModel(text: '''سُورَةُ الإِخْلَاصِ
بِسْمِ ٱللهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ
قُلْ هُوَ ٱللهُ أَحَدٌ * ٱللهُ ٱلصَّمَدُ * لَمْ يَلِدْ وَلَمْ يُولَدْ * وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌ *

سُورَةُ الْفَلَقِ
بِسْمِ ٱللهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ
قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ * مِن شَرِّ مَا خَلَقَ * وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِن شَرِّ ٱلنَّفَّـٰثَـٰتِ فِى ٱلْعُقَدِ * وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ *

سُورَةُ النَّاسِ
بِسْمِ ٱللهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ
قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ * مَلِكِ ٱلنَّاسِ * إِلَـٰهِ ٱلنَّاسِ * مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ * ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ * مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ *

المصدر: البخاري 5017، أبو داود 5056، الترمذي 3402''', repeat: 3),
      ZekrModel(text: '''أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ

المصدر: البخاري 11:101، مسلم 2702''', repeat: 100),
      ZekrModel(text: '''أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ

المصدر: البخاري 11:101، مسلم 2702''', repeat: 1),
      ZekrModel(
          text:
              '''اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً

المصدر: ابن ماجه 925''',
          repeat: 3),
    ],
  ),
  AzkarItem(
    title: "أذكار المساء",
    icon: Icons.nightlight_round,
    azkarTexts: [
      ZekrModel(text: '''اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ 
لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ
لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ 
مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ 
يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ 
وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ 
وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ 
وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ

[البقرة: 255]''', repeat: 1),
      ZekrModel(text: '''بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ
فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ

ثلاث مرات – صحيح الترمذي''', repeat: 4),
    ],
  ),
  AzkarItem(title: "أذكار الصلاة", icon: Icons.church, azkarTexts: [
    ZekrModel(
        text:
            ''' أَسْتَغْفِرُ اللَّهَ . (ثَلاثاً) اللَّهُمَّ أَنْتَ السَّلاَمُ، وَمِنْكَ السَّلَامُ، تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالإِكْرَامِ .

المصدر: مسلم 414:1''',
        repeat: 7),
    ZekrModel(
        text:
            ''' لَا إلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ.

المصدر: البخاري 255:1، مسلم 414:1''',
        repeat: 4),
    ZekrModel(
        text:
            '''سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَاللَّهُ أَكْبَرُ. (ثلاثاً وثلاثين) لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ .

المصدر: مسلم 415:1 ''',
        repeat: 7),
    ZekrModel(text: ''' سُورَةُ الإِخْلَاصِ 
بِسْمِ ٱللهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ 
قُلْ هُوَ ٱللهُ أَحَدٌ * ٱللهُ ٱلصَّمَدُ * لَمْ يَلِدْ وَلَمْ يُولَدْ * وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌ * 
 
سُورَةُ الْفَلَقِ 
بِسْمِ ٱللهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ 
قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ * مِن شَرِّ مَا خَلَقَ * وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِن شَرِّ ٱلنَّفَّـٰثَـٰتِ فِى ٱلْعُقَدِ * وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ * 
 
سُورَةُ النَّاسِ 
بِسْمِ ٱللهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ 
قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ * مَلِكِ ٱلنَّاسِ * إِلَـٰهِ ٱلنَّاسِ * مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ * ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ * مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ *

المصدر: أبو داود 5056، الترمذي 3402، النسائي 3:68''', repeat: 3),
    ZekrModel(
        text:
            ''' اللهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.

المصدر: سورة البقرة 255:2''',
        repeat: 7),
    ZekrModel(
        text:
            ''' لَا إِلَهَ إِلَّا اللَّهُ وَحَدْهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.

المصدر: الترمذي 515:5''',
        repeat: 3),
    ZekrModel(
        text:
            '''اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً .

المصدر: ابن ماجه 152:1 ''',
        repeat: 5),
  ])
];
